OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/combustion/buoyantReactingFoam/RAS/smallPoolFire3D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite
runApplication decomposePar -force
runParallel $application
runApplication reconstructPar

#------------------------------------------------------------------------------
